### 4일차 과제
- 생존자 분석
- 결측치 처리, 카테고리 정리 등등 배운거 다써보셈

In [54]:
import pandas as pd

In [55]:
file_path = '../data/titanic.csv'

In [56]:
data = pd.read_csv(file_path)

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [58]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [59]:
data.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [60]:
data.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [61]:
data['age'] = data['age'].fillna(0)
data['age'].isna().sum()

np.int64(0)

In [62]:
data['deck'] = data['deck'].fillna('-')
data['deck'].isna().sum()

np.int64(0)

In [63]:
data['embark_town'] = data['embark_town'].fillna('-')
data['embark_town'].isna().sum()

np.int64(0)

In [64]:
data['embarked'] = data['embarked'].fillna('na')
data['embarked'].isna().sum()

np.int64(0)

In [65]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [66]:
data.duplicated().sum()

np.int64(107)

In [67]:
data[data.duplicated()].index   # 뭘 기준으로 중복이라고 하는지 모르겠네...

Index([ 47,  76,  77,  87,  95, 101, 121, 133, 173, 196,
       ...
       838, 844, 846, 859, 863, 870, 877, 878, 884, 886],
      dtype='int64', length=107)

- 숫자인데 범주형인 데이터 : pclass, sibsp, parch, class
- 문자형인데 범주형인 데이터 : sex, who, adult_male, alone, embark_town
- fare 항목은 뭔가 애매함.

- 행 중복은 일단 넘기고 열 중복 체크
    - survived : alive, pclass : class

In [69]:
(data['survived'] == data['alive']).sum()

np.int64(0)

In [70]:
# 아차차
(data['survived'].replace([0, 1], ['no', 'yes']) == data['alive']).sum()

np.int64(891)

In [86]:
(data['pclass'] == data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3])).sum()

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_18568\1422182148.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  (data['pclass'] == data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3])).sum()

np.int64(891)

In [79]:
data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3]).value_counts()  # 뭐지? 왜 개수가 달라?

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_18568\459519995.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['class'].replace(['First', 'Second', 'Third'], [1, 2, 3]).value_counts()  # 뭐지? 왜 개수가 달라?

class
3    491
1    216
2    184
Name: count, dtype: int64

In [78]:
data['pclass'].value_counts()   # 아.. 오타...

pclass
3    491
1    216
2    184
Name: count, dtype: int64

- sex, who, adult_male 비교

In [87]:
(data['sex'].replace(['male', 'female'], ['man', 'woman'])).value_counts()

sex
man      577
woman    314
Name: count, dtype: int64

In [88]:
data['who'].value_counts()

who
man      537
woman    271
child     83
Name: count, dtype: int64

In [100]:
data['adult_male'].value_counts()

adult_male
True     537
False    354
Name: count, dtype: int64

In [112]:
((data['who'] == 'child') & (data['adult_male'] == False) & (data['sex'] == 'male')).sum()    # 성인남자 537, 성인여자 271, 남자아이 40, 여자아이 43

np.int64(40)

In [111]:
((data['sex'] == 'female') & (data['adult_male'] == False) & (data['who'] == 'child')).sum()

np.int64(43)

In [113]:
((data['sex'] == 'male') & (data['adult_male'] == True)).sum()

np.int64(537)

In [114]:
((data['sex'] == 'female') & (data['who'] == 'woman')).sum()

np.int64(271)

In [119]:
# 이제 이걸 합쳐야 하는데.. 어케 하징?
# 일단은 인덱스를 만들자.

boy = data[((data['who'] == 'child') & (data['adult_male'] == False) & (data['sex'] == 'male'))]
boy_idx = boy.index

girl = data[((data['sex'] == 'female') & (data['adult_male'] == False) & (data['who'] == 'child'))]
girl_idx = girl.index

man = data[((data['sex'] == 'male') & (data['adult_male'] == True))]
man_idx = man.index

woman = data[((data['sex'] == 'female') & (data['who'] == 'woman'))]
woman_idx = woman.index

print(boy_idx, girl_idx, man_idx, woman_idx, sep='\n\n')

Index([  7,  16,  50,  59,  63,  78, 125, 164, 165, 171, 182, 183, 193, 261,
       278, 305, 340, 348, 352, 386, 407, 445, 480, 489, 549, 683, 686, 731,
       751, 755, 787, 788, 802, 803, 819, 824, 827, 831, 850, 869],
      dtype='int64')

Index([  9,  10,  14,  22,  24,  39,  43,  58, 111, 119, 147, 172, 184, 205,
       233, 237, 297, 374, 381, 419, 435, 446, 448, 469, 479, 530, 535, 541,
       542, 618, 634, 642, 644, 689, 691, 720, 750, 777, 780, 813, 830, 852,
       875],
      dtype='int64')

Index([  0,   4,   5,   6,  12,  13,  17,  20,  21,  23,
       ...
       873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
      dtype='int64', length=537)

Index([  1,   2,   3,   8,  11,  15,  18,  19,  25,  28,
       ...
       865, 866, 871, 874, 879, 880, 882, 885, 887, 888],
      dtype='int64', length=271)

In [120]:
# 성인남자, 성인여자, 남자아이, 여자아이 를 포함하는 범주가 뭐지?
data['gender'] = '-'
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  gender       891 non-null    object
dtypes: bool(2), float64(2), int64(4), object(8)
memory usage: 99.3+ KB

In [122]:
data.loc[man_idx, 'gender'] = 'man'
data.loc[woman_idx, 'gender'] = 'woman'
data.loc[boy_idx, 'gender'] = 'boy'
data.loc[girl_idx, 'gender'] = 'girl'

In [123]:
data['gender'].value_counts()

gender
man      537
woman    271
girl      43
boy       40
Name: count, dtype: int64

In [126]:
# 다시한번 행 중복 검사
data.duplicated().sum() # 왜?

np.int64(107)

In [129]:
# 이렇게 된 이상 날릴지 말지를 정하기 위해 여러 인덱스를 보자!
print(data[data.duplicated()].index, data[data.duplicated(keep='last')].index, sep='\n\n')

Index([ 47,  76,  77,  87,  95, 101, 121, 133, 173, 196,
       ...
       838, 844, 846, 859, 863, 870, 877, 878, 884, 886],
      dtype='int64', length=107)

Index([  4,  26,  28,  29,  32,  37,  42,  45,  46,  47,
       ...
       658, 674, 722, 733, 738, 739, 784, 792, 795, 832],
      dtype='int64', length=107)

- 실제 데이터에서 인덱스를 찾아서 모아보니 진짜 ㄹㅇ 다 중복되는 데이터 였음.
- 여기서 나온 행 중복을 완전히 날리는 것도 아닌것 같음.
- DataFrame을 날린거랑 안 날린거랑 비교해도 괜찮지 않을까?

In [130]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         891 non-null    object
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  gender       891 non-null    object
dtypes: bool(2), float64(2), int64(4), object(8)
memory usage: 99.3+ KB

In [134]:
# 필요없는 컬럼 삭제
df_1 = data.drop(columns=['sex', 'class', 'who', 'adult_male', 'alive', 'embarked', 'deck'])
df_2 = df_1.drop_duplicates()

In [135]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   age          891 non-null    float64
 3   sibsp        891 non-null    int64
 4   parch        891 non-null    int64
 5   fare         891 non-null    float64
 6   embark_town  891 non-null    object
 7   alone        891 non-null    bool
 8   gender       891 non-null    object
dtypes: bool(1), float64(2), int64(4), object(2)
memory usage: 56.7+ KB

In [136]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 780 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     780 non-null    int64
 1   pclass       780 non-null    int64
 2   age          780 non-null    float64
 3   sibsp        780 non-null    int64
 4   parch        780 non-null    int64
 5   fare         780 non-null    float64
 6   embark_town  780 non-null    object
 7   alone        780 non-null    bool
 8   gender       780 non-null    object
dtypes: bool(1), float64(2), int64(4), object(2)
memory usage: 55.6+ KB